Autodesk.Revit.DB.Structure.FabricSheet.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this fabric sheet to be shown unobscured in a view.
view:
The view element
unobscured:
True if fabric sheet is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this fabric sheet to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if fabric sheet is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this fabric sheet is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if fabric sheet is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.SetSegmentLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
segmentParameterId:
The segment ID of the bent fabric sheet.
value:
The length value to set
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not a number
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.SetBendProfile(Autodesk.Revit.DB.CurveLoop)
Sets new profile that defines the shape of the Fabric Sheet bending.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.PlaceInHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Inserts the single Fabric Sheet instance into the host element.
hostElement:
A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The host Element is not a valid host for Fabric Sheet.
-or-
transform defines the placement out of the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop)
Creates a new instance of a single bent Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
concreteHostElementId:
The element that will host the FabricSheet.
The host can be a Structural Floor, Structural Wall, Structural Slab, Structural Floor Edge, Structural Slab Edge,
Structural Column, Beam and Brace.
Also, host can be a Autodesk::Revit::DB::Part created from a structural layer of Structural Floor, Structural Wall or Structural Slab.
fabricSheetTypeId:
The id of the FabricSheetType.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Returns:
The instance of the newly created bent fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
concreteHostElementId is not a valid ElementId for the host Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
-or-
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Creates a new instance of a single flat Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
hostElement:
The element that will host the FabricSheet. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created single Fabric Sheet instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
The host Element is not a valid host for Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015